; domain
;  (c) 2001 Copyright (c) University of Huddersfield
;  Automatically produced from GIPO from the domain hiking
;  All rights reserved. Use of this software is permitted for non-commercial
;  research purposes, and it may be copied only for that use.  All copies must
;  include this copyright message.  This software is made available AS IS, and
;  neither the GIPO team nor the University of Huddersfield make any warranty about
;  the software or its performance.

(define (domain hiking)
  (:requirements :strips :equality :typing :negative-preconditions)
  (:types car tent person couple place )
  (:predicates 
              (at_tent ?x1 - tent ?x2 - place)
              (at_person ?x1 - person ?x2 - place)
              (at_car ?x1 - car ?x2 - place)
              (partners ?x1 - couple ?x2 - person ?x3 - person)
              (up ?x1 - tent)
              (down ?x1 - tent)
              (walked ?x1 - couple ?x2 - place)
              (next ?x1 - place ?x2 - place)
)

  (:action put_down
         :parameters ( ?x1 - person ?x2 - place ?x3 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_tent ?x3 ?x2)(up ?x3))
         :effect (and (down ?x3)(not (up ?x3))
)
)
  (:action put_up
         :parameters ( ?x1 - person ?x2 - place ?x3 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_tent ?x3 ?x2)(down ?x3))
         :effect (and (up ?x3)(not (down ?x3))
)
)
  (:action drive_passenger
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - person)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_person ?x5 ?x2)(not (= ?x1 ?x5)))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_person ?x5 ?x3)(not (at_person ?x5 ?x2))
)
)
  (:action drive
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
)
)
  (:action drive_tent
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_tent ?x5 ?x2)(down ?x5))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_tent ?x5 ?x3)(not (at_tent ?x5 ?x2))
)
)
  (:action drive_tent_passenger
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - tent ?x6 - person)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_tent ?x5 ?x2)(down ?x5)(at_person ?x6 ?x2)(not (= ?x1 ?x6)))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_tent ?x5 ?x3)(not (at_tent ?x5 ?x2))
(at_person ?x6 ?x3)(not (at_person ?x6 ?x2))
)
)
  (:action walk_together
         :parameters ( ?x1 - tent ?x2 - place ?x3 - person ?x4 - place ?x5 - person ?x6 - couple)
         :precondition (and 
(at_tent ?x1 ?x2)(up ?x1)(at_person ?x3 ?x4)(next ?x4 ?x2)(at_person ?x5 ?x4)(not (= ?x3 ?x5))(walked ?x6 ?x4)(partners ?x6 ?x3 ?x5))
         :effect (and (at_person ?x3 ?x2)(not (at_person ?x3 ?x4))
(at_person ?x5 ?x2)(not (at_person ?x5 ?x4))
(walked ?x6 ?x2)(not (walked ?x6 ?x4))
)
)

)

; problem
(define (problem Hiking-1-6-8)
(:domain hiking)
(:objects 
 car0 car1 car2 car3 car4 car5 - car
 tent0 - tent
 couple0 - couple
 place0 place1 place2 place3 place4 place5 place6 place7 - place
 guy0 girl0 - person
)
(:init
(partners couple0 guy0 girl0)
(at_person guy0 place0)
(at_person girl0 place0)
(walked couple0 place0)
(at_tent tent0 place0)
(up tent0)
(at_car car0 place0)
(at_car car1 place0)
(at_car car2 place0)
(at_car car3 place0)
(at_car car4 place0)
(at_car car5 place0)
(next place0 place1)
(next place1 place2)
(next place2 place3)
(next place3 place4)
(next place4 place5)
(next place5 place6)
(next place6 place7)
)
(:goal
(and
(walked couple0 place7)
)
)
)

; plan
1. (put_down girl0 place0 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
2. (drive_tent guy0 place0 place1 car1 tent0)
   deleted: (at_person guy0 place0) (at_car car1 place0) (at_tent tent0 place0)
   added: (at_person guy0 place1) (at_car car1 place1) (at_tent tent0 place1)
   goals met: 0 of 1
3. (put_up guy0 place1 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
4. (drive girl0 place0 place1 car0)
   deleted: (at_person girl0 place0) (at_car car0 place0)
   added: (at_person girl0 place1) (at_car car0 place1)
   goals met: 0 of 1
5. (drive_passenger girl0 place1 place0 car1 guy0)
   deleted: (at_person girl0 place1) (at_car car1 place1) (at_person guy0 place1)
   added: (at_person girl0 place0) (at_car car1 place0) (at_person guy0 place0)
   goals met: 0 of 1
6. (walk_together tent0 place1 guy0 place0 girl0 couple0)
   deleted: (at_person guy0 place0) (at_person girl0 place0) (walked couple0 place0)
   added: (at_person guy0 place1) (at_person girl0 place1) (walked couple0 place1)
   goals met: 0 of 1
7. (put_down girl0 place1 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
8. (drive_tent_passenger girl0 place1 place0 car0 tent0 guy0)
   deleted: (at_person girl0 place1) (at_car car0 place1) (at_tent tent0 place1) (at_person guy0 place1)
   added: (at_person girl0 place0) (at_car car0 place0) (at_tent tent0 place0) (at_person guy0 place0)
   goals met: 0 of 1
9. (drive_tent guy0 place0 place2 car3 tent0)
   deleted: (at_person guy0 place0) (at_car car3 place0) (at_tent tent0 place0)
   added: (at_person guy0 place2) (at_car car3 place2) (at_tent tent0 place2)
   goals met: 0 of 1
10. (put_up guy0 place2 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
11. (drive girl0 place0 place2 car0)
   deleted: (at_person girl0 place0) (at_car car0 place0)
   added: (at_person girl0 place2) (at_car car0 place2)
   goals met: 0 of 1
12. (drive_passenger girl0 place2 place1 car3 guy0)
   deleted: (at_person girl0 place2) (at_car car3 place2) (at_person guy0 place2)
   added: (at_person girl0 place1) (at_car car3 place1) (at_person guy0 place1)
   goals met: 0 of 1
13. (walk_together tent0 place2 guy0 place1 girl0 couple0)
   deleted: (at_person guy0 place1) (at_person girl0 place1) (walked couple0 place1)
   added: (at_person guy0 place2) (at_person girl0 place2) (walked couple0 place2)
   goals met: 0 of 1
14. (put_down girl0 place2 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
15. (drive_tent_passenger girl0 place2 place0 car0 tent0 guy0)
   deleted: (at_person girl0 place2) (at_car car0 place2) (at_tent tent0 place2) (at_person guy0 place2)
   added: (at_person girl0 place0) (at_car car0 place0) (at_tent tent0 place0) (at_person guy0 place0)
   goals met: 0 of 1
16. (drive_tent guy0 place0 place3 car2 tent0)
   deleted: (at_person guy0 place0) (at_car car2 place0) (at_tent tent0 place0)
   added: (at_person guy0 place3) (at_car car2 place3) (at_tent tent0 place3)
   goals met: 0 of 1
17. (put_up guy0 place3 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
18. (drive girl0 place0 place3 car0)
   deleted: (at_person girl0 place0) (at_car car0 place0)
   added: (at_person girl0 place3) (at_car car0 place3)
   goals met: 0 of 1
19. (drive_passenger girl0 place3 place2 car2 guy0)
   deleted: (at_person girl0 place3) (at_car car2 place3) (at_person guy0 place3)
   added: (at_person girl0 place2) (at_car car2 place2) (at_person guy0 place2)
   goals met: 0 of 1
20. (walk_together tent0 place3 guy0 place2 girl0 couple0)
   deleted: (at_person guy0 place2) (at_person girl0 place2) (walked couple0 place2)
   added: (at_person guy0 place3) (at_person girl0 place3) (walked couple0 place3)
   goals met: 0 of 1
21. (put_down girl0 place3 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
22. (drive_tent_passenger girl0 place3 place0 car0 tent0 guy0)
   deleted: (at_person girl0 place3) (at_car car0 place3) (at_tent tent0 place3) (at_person guy0 place3)
   added: (at_person girl0 place0) (at_car car0 place0) (at_tent tent0 place0) (at_person guy0 place0)
   goals met: 0 of 1
23. (drive_tent guy0 place0 place4 car1 tent0)
   deleted: (at_person guy0 place0) (at_car car1 place0) (at_tent tent0 place0)
   added: (at_person guy0 place4) (at_car car1 place4) (at_tent tent0 place4)
   goals met: 0 of 1
24. (drive girl0 place0 place4 car0)
   deleted: (at_person girl0 place0) (at_car car0 place0)
   added: (at_person girl0 place4) (at_car car0 place4)
   goals met: 0 of 1
25. (put_up girl0 place4 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
26. (drive_passenger girl0 place4 place3 car0 guy0)
   deleted: (at_person girl0 place4) (at_car car0 place4) (at_person guy0 place4)
   added: (at_person girl0 place3) (at_car car0 place3) (at_person guy0 place3)
   goals met: 0 of 1
27. (walk_together tent0 place4 guy0 place3 girl0 couple0)
   deleted: (at_person guy0 place3) (at_person girl0 place3) (walked couple0 place3)
   added: (at_person guy0 place4) (at_person girl0 place4) (walked couple0 place4)
   goals met: 0 of 1
28. (put_down girl0 place4 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
29. (drive_tent_passenger girl0 place4 place0 car1 tent0 guy0)
   deleted: (at_person girl0 place4) (at_car car1 place4) (at_tent tent0 place4) (at_person guy0 place4)
   added: (at_person girl0 place0) (at_car car1 place0) (at_tent tent0 place0) (at_person guy0 place0)
   goals met: 0 of 1
30. (drive girl0 place0 place5 car1)
   deleted: (at_person girl0 place0) (at_car car1 place0)
   added: (at_person girl0 place5) (at_car car1 place5)
   goals met: 0 of 1
31. (drive_tent guy0 place0 place5 car4 tent0)
   deleted: (at_person guy0 place0) (at_car car4 place0) (at_tent tent0 place0)
   added: (at_person guy0 place5) (at_car car4 place5) (at_tent tent0 place5)
   goals met: 0 of 1
32. (put_up girl0 place5 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
33. (drive_passenger girl0 place5 place4 car1 guy0)
   deleted: (at_person girl0 place5) (at_car car1 place5) (at_person guy0 place5)
   added: (at_person girl0 place4) (at_car car1 place4) (at_person guy0 place4)
   goals met: 0 of 1
34. (walk_together tent0 place5 guy0 place4 girl0 couple0)
   deleted: (at_person guy0 place4) (at_person girl0 place4) (walked couple0 place4)
   added: (at_person guy0 place5) (at_person girl0 place5) (walked couple0 place5)
   goals met: 0 of 1
35. (put_down girl0 place5 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
36. (drive_tent_passenger girl0 place5 place0 car4 tent0 guy0)
   deleted: (at_person girl0 place5) (at_car car4 place5) (at_tent tent0 place5) (at_person guy0 place5)
   added: (at_person girl0 place0) (at_car car4 place0) (at_tent tent0 place0) (at_person guy0 place0)
   goals met: 0 of 1
37. (drive girl0 place0 place6 car4)
   deleted: (at_person girl0 place0) (at_car car4 place0)
   added: (at_person girl0 place6) (at_car car4 place6)
   goals met: 0 of 1
38. (drive_tent guy0 place0 place6 car5 tent0)
   deleted: (at_person guy0 place0) (at_car car5 place0) (at_tent tent0 place0)
   added: (at_person guy0 place6) (at_car car5 place6) (at_tent tent0 place6)
   goals met: 0 of 1
39. (put_up girl0 place6 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
40. (drive_passenger girl0 place6 place5 car4 guy0)
   deleted: (at_person girl0 place6) (at_car car4 place6) (at_person guy0 place6)
   added: (at_person girl0 place5) (at_car car4 place5) (at_person guy0 place5)
   goals met: 0 of 1
41. (walk_together tent0 place6 guy0 place5 girl0 couple0)
   deleted: (at_person guy0 place5) (at_person girl0 place5) (walked couple0 place5)
   added: (at_person guy0 place6) (at_person girl0 place6) (walked couple0 place6)
   goals met: 0 of 1
42. (put_down girl0 place6 tent0)
   deleted: (up tent0)
   added: (down tent0)
   goals met: 0 of 1
43. (drive_tent girl0 place6 place7 car5 tent0)
   deleted: (at_person girl0 place6) (at_car car5 place6) (at_tent tent0 place6)
   added: (at_person girl0 place7) (at_car car5 place7) (at_tent tent0 place7)
   goals met: 0 of 1
44. (put_up girl0 place7 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 1
45. (drive girl0 place7 place6 car5)
   deleted: (at_person girl0 place7) (at_car car5 place7)
   added: (at_person girl0 place6) (at_car car5 place6)
   goals met: 0 of 1
46. (walk_together tent0 place7 guy0 place6 girl0 couple0)
   deleted: (at_person guy0 place6) (at_person girl0 place6) (walked couple0 place6)
   added: (at_person guy0 place7) (at_person girl0 place7) (walked couple0 place7)
   goals met: 1 of 1
